---
title: PointCollection
classe: Autodesk.Revit.DB.PointClouds.PointCollection
namespace: Autodesk.Revit.DB.PointClouds
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# PointCollection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `pointCollection.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `pointCollection.IsValidObject` | Boolean |
| `Void Dispose()` | `pointCollection.Dispose()` | Void |
| `IEnumerator<CloudPoint> GetEnumerator()` | `pointCollection.GetEnumerator()` | IEnumerator<CloudPoint> |
| `IntPtr GetPointBufferPointer()` | `pointCollection.GetPointBufferPointer()` | IntPtr |
| `PointIterator GetPointIterator()` | `pointCollection.GetPointIterator()` | PointIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```